In [1]:
import pandas as pd  
import numpy as np

# 3. Create get_db_url function

In [2]:
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/{db_name}'

# 4. Use function to obtain connection to employees database

In [3]:
query_emp = '''
select * from employees limit 5
'''
url_emp = get_db_url('employees')

df = pd.read_sql(query_emp, url_emp)
df

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# 5a. Intentional database url typo

# 5b. Intentional SQL query error

# 6. Read the employees and titles tables in two separate DataFrames

In [4]:
query_titles = '''
select * from titles limit 5
'''

url_titles = get_db_url('employees')

df_titles = pd.read_sql(query_titles, url_titles)
df_titles

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [5]:
df_emp = pd.read_sql(query_emp, url_emp)
df_emp

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

# 7. How many rows and columns in each DataFrame?

In [6]:
df_emp.shape

(5, 6)

In [7]:
df_titles.shape

(5, 4)

# 8. Display summary statistics for each DataFrame

In [9]:
df_emp.describe()

             emp_no
count      5.000000
mean   10003.000000
std        1.581139
min    10001.000000
25%    10002.000000
50%    10003.000000
75%    10004.000000
max    10005.000000

In [10]:
df_titles.describe()

            emp_no
count      5.00000
mean   10002.80000
std        1.30384
min    10001.00000
25%    10002.00000
50%    10003.00000
75%    10004.00000
max    10004.00000

# 9. How many unique titles are in the titles DataFrame?

# 10. What is the oldest date in the to_date column?

# 11. What is the most recent date in the to_date column?

# Part II

# 1. Copy the users and roles DataFrames from the examples above.

In [11]:
#users df
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [12]:
#roles df
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

# 2. What is the result of using a right join on the DataFrames?

In [13]:
users.merge(roles, 
           left_on='role_id', 
           right_on='id',
           how='right',
          )

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

# 3. What is the result of using an outer join on the DataFrames?

In [14]:
users.merge(roles, 
           left_on='role_id', 
           right_on='id',
           how='outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

# 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [43]:
# users_x = users.drop(columns='role_id')
# users_x

# roles_x = roles.drop(columns='id')
# roles_x

# users_x.merge(roles_x, 
#            left_on='role_id', 
#            right_on='id',
#            how='right',
#           )

# 5. Load the mpg dataset from PyDataset.

In [33]:
from pydataset import data

In [35]:
mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

# 6. Output and read the documentation for the mpg dataset.

In [36]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

# 7. How many rows and columns are in the dataset?

In [39]:
mpg.shape

#234 rows, 11 columns

(234, 11)

# 8. Check out your column names and perform any cleanup you may want on them.

In [50]:
#   * manufacturer. 

#   * model. 

#   * displ. engine displacement, in litres 

#   * year. 

#   * cyl. number of cylinders 

#   * trans. type of transmission 

#   * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd 

#   * cty. city miles per gallon 

#   * hwy. highway miles per gallon 

#   * fl. 

#   * class. 
mpg.columns = ['manufacturer', 
               'model', 
               'eng_displ', 
               'year', 
               'no_cyl', 
               'trans_type', 
               'drive_type', 
               'cty_mpg', 
               'hwy_mpg', 
               'fl', 
               'class']
mpg.head()

,manufacturer,model,eng_displ,year,no_cyl,trans_type,drive_type,cty_mpg,hwy_mpg,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

# 9. Display the summary statistics for the dataset.

In [53]:
print(mpg.describe())
print()
print(mpg.info())

        eng_displ         year      no_cyl     cty_mpg     hwy_mpg
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   eng_displ     234 non-null    float64
 3   year          234 non-null    int64
 4   no_cyl        234 non-null    int64
 5   trans_type    234 non-null    object
 6   drive_type    234 non-null    object
 7   cty_mpg       234 non-null    int64
 8   hwy_mpg       234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB
None

# 10. How many different manufacturers are there?

In [89]:
mpg.head()

print(len(mpg.groupby(by='manufacturer').count()))
print()

print(mpg.groupby(by='manufacturer').count().head())

15

              model  eng_displ  year  no_cyl  trans_type  drive_type  cty_mpg  \
manufacturer
audi             18         18    18      18          18          18       18
chevrolet        19         19    19      19          19          19       19
dodge            37         37    37      37          37          37       37
ford             25         25    25      25          25          25       25
honda             9          9     9       9           9           9        9

              hwy_mpg  fl  class
manufacturer
audi               18  18     18
chevrolet          19  19     19
dodge              37  37     37
ford               25  25     25
honda               9   9      9

# 11. How many different models are there?

In [88]:
print(len(mpg.groupby('model').agg('count')))

print(mpg.groupby('model').agg('count').head())

38
             manufacturer  eng_displ  year  no_cyl  trans_type  drive_type  \
model
4runner 4wd             6          6     6       6           6           6
a4                      7          7     7       7           7           7
a4 quattro              8          8     8       8           8           8
a6 quattro              3          3     3       3           3           3
altima                  6          6     6       6           6           6

             cty_mpg  hwy_mpg  fl  class
model
4runner 4wd        6        6   6      6
a4                 7        7   7      7
a4 quattro         8        8   8      8
a6 quattro         3        3   3      3
altima             6        6   6      6

# 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

# 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

# 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

# 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

# 16. Do automatic or manual cars have better miles per gallon?